export const questions = [
  {
    id: 1,
    text: "පසුගිය සති 4 තුළ කිසිම විශේෂ හේතුවක් නොමැතිව ඔබට කොපමණ වාරයක් අධික මහන්සියක් හෝ වෙහෙසක් (Tired out) දැනුණාද?",
  },
  {
    id: 2,
    text: "පසුගිය සති 4 තුළ ඔබට කොපමණ වාරයක් කලබලකාරී ස්වභාවයක් (Nervous), අනාගතය පිළිබඳ බියක් හෝ හිතේ දැඩි තැවුලක් දැනුණාද?",
  },
  {
    id: 3,
    text: "පසුගිය සති 4 තුළ පාලනය කරගත නොහැකි ලෙස විවිධ දේවල් ගැන අනවශ්‍ය ලෙස සිතමින් (Overthinking), කිසිම දෙයකින් සන්සුන් කළ නොහැකි තරමේ දැඩි කලබලකාරී බවක් කොපමණ වාරයක් දැනුණාද?",
  },
  {
    id: 4,
    text: "පසුගිය සති 4 තුළ පවුලේ ප්‍රශ්න, මූල්‍ය ගැටලු හෝ අධ්‍යාපන පීඩනය නිසා කිසිදු බලාපොරොත්තුවක් නොමැති බවක් (Hopeless) ඔබට කොපමණ වාරයක් දැනුණාද?",
  },
  {
    id: 5,
    text: "පසුගිය සති 4 තුළ ඔබට කොපමණ වාරයක් සුළු දේටත් ඉක්මනින් කේන්ති යාමක්, නොසන්සුන් බවක් හෝ එක තැනක රැඳී සිටීමට අපහසු බවක් (Restless) දැනුණාද?",
  },
  {
    id: 6,
    text: "පසුගිය සති 4 තුළ එක තැනක වාඩි වී සිටීමට පවා නොහැකි තරම් වූ දැඩි නොසන්සුන් බවක් ඔබට කොපමණ වාරයක් දැනුණාද?",
  },
  {
    id: 7,
    text: "පසුගිය සති 4 තුළ, දිනපදා වැඩකටයුතු හෝ විනෝදාංශ කිරීමට ඇති උනන්දුව සහ සතුට අඩුවී යන තරමේ දැඩි මානසික අවපීඩනයක් (Depressed) ඔබට කොපමණ වාරයක් දැනුණාද?",
  },
  {
    id: 8,
    text: "පසුගිය සති 4 තුළ ශාරීරික අපහසුතා (හිසරදය, බඩේ අමාරු) හේතුවෙන් සුළු වැඩක් කිරීම පවා මහත් ආයාසයක් (Effort) ලෙස ඔබට කොපමණ වාරයක් දැනුණාද?",
  },
  {
    id: 9,
    text: "පසුගිය සති 4 තුළ, ඔබගේ සාමාන්‍ය නින්දේ රටාවේ හෝ ආහාර ගැනීමේ පුරුදුවල කැපී පෙනෙන වෙනසක් සිදුවී ඇති බවක් ඔබට කොපමණ වාරයක් දැනුණාද?",
  },
  {
    id: 10,
    text: "පසුගිය සති 4 තුළ ඔබ කිසිදු වටිනාකමක් නැති (Worthless) හෝ පවුලේ අයට වදයක් යැයි හැඟීමක් හෝ ජීවත් වෙනවාට වඩා මිය යාම හොඳ යැයි සිතුවිලි කොපමණ වාරයක් ඇතිවුණාද?",
  }
];

export const options = [
  { id: 1, text: "කිසිවිටෙකත් නැත (None of the time)" },
  { id: 2, text: "කලාතුරකින් (A little of the time)" },
  { id: 3, text: "සමහර විට (Some of the time)" },
  { id: 4, text: "බොහෝ විට (Most of the time)" },
  { id: 5, text: "සෑම විටම (All of the time)" }
];
